#5 Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма (прибыль — выручка больше издержек, или убыток — издержки больше выручки).
# Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

vyr = int(input('Введите Выручку фирмы: ')) # :)
izd = int(input('Введите Издержки фирмы: ')) # :)))

if vyr >= izd:
    print('Финансовй результат Положительный! Получена Прибыль:', vyr - izd, 'тугриков')
    rent = vyr / izd
    print('Рентабельность =', rent)
    emp = int(input('Сколько сотрудников работает в фирме? '))
    print('Прибыль фирмы, в расчете на одного сотрудника:', (vyr - izd) / emp, 'тугриков')
elif vyr < izd:
    print('Финансовй результат Отрицательный! Получен Убыток:', izd - vyr, 'тугриков')
